``` Terraform will perform the following actions:

  # aws_route53_record.subdomains[41] will be created
  + resource "aws_route53_record" "subdomains" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "astronomy.usegalaxy.eu"
      + records         = [
          + "usegalaxy.eu",
        ]
      + ttl             = 7200
      + type            = "CNAME"
      + zone_id         = "Z1C7L7XFF9613J"
    }

  # openstack_compute_instance_v2.celery[0] will be created
  + resource "openstack_compute_instance_v2" "celery" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xxlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = "40226406-34a7-48a8-8daf-b674cdec93b6"
      + image_name          = (known after apply)
      + key_pair            = "cloud2"
      + name                = "celery-0.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
          + "ingress-from-proxy",
        ]
      + stop_before_destroy = false
      + user_data           = "f1afc818d33a9c6c68d6c2dd4401f2e9abd7f8fc"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "bioinf"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_networking_secgroup_rule_v2.interactive-egress-internal-network will be created
  + resource "openstack_networking_secgroup_rule_v2" "interactive-egress-internal-network" {
      + direction         = "egress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = (known after apply)
      + port_range_min    = (known after apply)
      + protocol          = (known after apply)
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "10.0.0.0/8"
      + security_group_id = "2df98248-0b6a-4763-90a8-e77a859d2457"
      + tenant_id         = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```